of40/tutorials/rheoEFoam/ICEO/NernstPlanck/0/cAnion
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ciAnion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 9.48946E-05;

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform 9.48946E-05;       
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform 9.48946E-05;      
    }
    
    cylinder
    {
	type            zeroIonicFlux;
	value           uniform 9.48946E-05;       
    }

    "wall.*"
    {
	type            zeroGradient;       
    }
    
    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
