of40/tutorials/rheoEFoam/ICEO/NernstPlanck/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform 0.012926;      
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform -0.012926;        
    }
    
    cylinder
    {
	type            fixedValue;
	value           uniform 0;
    }

    "wall.*"
    {
	type            zeroGradient;    
    }

    frontAndBack
    {
	type            empty;     
    }    
}

// ************************************************************************* //
